project-chip/connectedhomeip/examples/platform/nxp/rt/rt1060/board/evkbmimxrt1060/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput         = 0U, /* Input direction */
    kPIN_MUX_DirectionOutput        = 1U, /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK                                                                    \
    0x04U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J18[2]/BT_RST#/J8[54]/CSI_PWDN/PWDN/J46[17]/J16[7] */
/* Routed pin properties */
#define BOARD_INITPINS_SPDIF_OUT_PERIPHERAL LPUART2 /*!< Peripheral name */
#define BOARD_INITPINS_SPDIF_OUT_SIGNAL TX          /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD/J13[2] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PERIPHERAL LPUART1 /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_SIGNAL TX          /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD/J11[2] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PERIPHERAL LPUART1 /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_SIGNAL RX          /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0/U16[H7] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A0_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A0_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A0_CHANNEL 0U      /*!< Signal channel */

/* GPIO_EMC_10 (coord G1), SEMC_A1/U16[H8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A1_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A1_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A1_CHANNEL 1U      /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), SEMC_A2/U16[J8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A2_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A2_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A2_CHANNEL 2U      /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), SEMC_A3/U16[J7] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A3_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A3_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A3_CHANNEL 3U      /*!< Signal channel */

/* GPIO_EMC_13 (coord A6), SEMC_A4/U16[J3] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A4_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A4_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A4_CHANNEL 4U      /*!< Signal channel */

/* GPIO_EMC_14 (coord B6), SEMC_A5/U16[J2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A5_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A5_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A5_CHANNEL 5U      /*!< Signal channel */

/* GPIO_EMC_15 (coord B1), SEMC_A6/U16[H3] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A6_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A6_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A6_CHANNEL 6U      /*!< Signal channel */

/* GPIO_EMC_16 (coord A5), SEMC_A7/U6[H2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A7_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A7_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A7_CHANNEL 7U      /*!< Signal channel */

/* GPIO_EMC_17 (coord A4), SEMC_A8/U16[H1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A8_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A8_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A8_CHANNEL 8U      /*!< Signal channel */

/* GPIO_EMC_18 (coord B2), SEMC_A9/U16[G3] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A9_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A9_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A9_CHANNEL 9U      /*!< Signal channel */

/* GPIO_EMC_23 (coord G2), SEMC_A10/U16[H9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A10_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A10_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A10_CHANNEL 10U     /*!< Signal channel */

/* GPIO_EMC_19 (coord B4), SEMC_A11/U6[G2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A11_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A11_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A11_CHANNEL 11U     /*!< Signal channel */

/* GPIO_EMC_20 (coord A3), SEMC_A12/U16[G1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A12_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A12_SIGNAL ADDR     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A12_CHANNEL 12U     /*!< Signal channel */

/* GPIO_EMC_21 (coord C1), SEMC_BA0/U16[G7] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA0_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_SIGNAL BA       /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_CHANNEL 0U      /*!< Signal channel */

