project-chip/connectedhomeip/examples/platform/nxp/rt/rt1060/board/evkbmimxrt1060/pin_mux.h
/* GPIO_EMC_22 (coord F1), SEMC_BA1/U16[G8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA1_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_SIGNAL BA       /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_CHANNEL 1U      /*!< Signal channel */

/* GPIO_EMC_24 (coord D3), SEMC_CAS/U16[F7] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CAS_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CAS_SIGNAL semc_cas /*!< Signal name */

/* GPIO_EMC_27 (coord A2), SEMC_CKE/U16[F3] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CKE_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CKE_SIGNAL semc_cke /*!< Signal name */

/* GPIO_EMC_26 (coord B3), SEMC_CLK/U16[F2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_SIGNAL semc_clk /*!< Signal name */

/* GPIO_EMC_00 (coord E3), SEMC_D0/U16[A8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D0_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D0_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D0_CHANNEL 0U      /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), SEMC_D1/U16[B9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D1_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D1_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D1_CHANNEL 1U      /*!< Signal channel */

/* GPIO_EMC_02 (coord F4), SEMC_D2/U16[B8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D2_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D2_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D2_CHANNEL 2U      /*!< Signal channel */

/* GPIO_EMC_03 (coord G4), SEMC_D3/U16[C9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D3_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D3_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D3_CHANNEL 3U      /*!< Signal channel */

/* GPIO_EMC_04 (coord F2), SEMC_D4/U16[C8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D4_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D4_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D4_CHANNEL 4U      /*!< Signal channel */

/* GPIO_EMC_05 (coord G5), SEMC_D5/U16[D9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D5_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D5_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D5_CHANNEL 5U      /*!< Signal channel */

/* GPIO_EMC_06 (coord H5), SEMC_D6/U16[D8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D6_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D6_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D6_CHANNEL 6U      /*!< Signal channel */

/* GPIO_EMC_07 (coord H4), SEMC_D7/U16[E9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D7_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D7_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D7_CHANNEL 7U      /*!< Signal channel */

/* GPIO_EMC_30 (coord C6), SEMC_D8/U16[E1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D8_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D8_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D8_CHANNEL 8U      /*!< Signal channel */

/* GPIO_EMC_31 (coord C5), SEMC_D9/U16[D2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D9_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D9_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D9_CHANNEL 9U      /*!< Signal channel */

/* GPIO_EMC_32 (coord D5), SEMC_D10/U16[D1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D10_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D10_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D10_CHANNEL 10U     /*!< Signal channel */

/* GPIO_EMC_33 (coord C4), SEMC_D11/U16[C2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D11_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D11_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D11_CHANNEL 11U     /*!< Signal channel */

/* GPIO_EMC_34 (coord D4), SEMC_D12/U16[C1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D12_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D12_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D12_CHANNEL 12U     /*!< Signal channel */

/* GPIO_EMC_35 (coord E5), SEMC_D13/U16[B2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D13_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D13_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D13_CHANNEL 13U     /*!< Signal channel */

/* GPIO_EMC_36 (coord C3), SEMC_D14/U16[B1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D14_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D14_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D14_CHANNEL 14U     /*!< Signal channel */

/* GPIO_EMC_37 (coord E4), SEMC_D15/U16[A2] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D15_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D15_SIGNAL DATA     /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D15_CHANNEL 15U     /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), SEMC_DM0/U16[E8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_SIGNAL DM       /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_CHANNEL 0U      /*!< Signal channel */

/* GPIO_EMC_38 (coord D6), SEMC_DM1/U16[F1] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_SIGNAL DM       /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_CHANNEL 1U      /*!< Signal channel */

/* GPIO_EMC_25 (coord D2), SEMC_RAS/U16[F8] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_SIGNAL semc_ras /*!< Signal name */

/* GPIO_EMC_28 (coord D1), SEMC_WE/U16[F9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_WE_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_WE_SIGNAL semc_we  /*!< Signal name */

