project-chip/connectedhomeip/examples/platform/nxp/rt/rt1060/board/evkbmimxrt1060/pin_mux.h
/* GPIO_EMC_29 (coord E1), SEMC_CS0/U16[G9] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CS0_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CS0_SIGNAL CS       /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_CS0_CHANNEL 0U      /*!< Signal channel */

/* GPIO_EMC_39 (coord B7), SEMC_DQS */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DQS_PERIPHERAL SEMC /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DQS_SIGNAL semc_dqs /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

#define BOARD_INITENETPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK                                                                \
    0x0600U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_EMC_40 (coord A7), ENET_MDC/U18[12] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL ENET /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL enet_mdc /*!< Signal name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO/U18[11] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL ENET  /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL enet_mdio /*!< Signal name */

/* GPIO_B1_10 (coord B13), ENET_TX_REF_CLK/U18[9] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_PERIPHERAL ENET     /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_SIGNAL enet_ref_clk /*!< Signal name */

/* GPIO_B1_04 (coord E12), ENET_RXD0/U18[16] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL ENET     /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL enet_rx_data /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL 0U          /*!< Signal channel */

/* GPIO_B1_05 (coord D12), ENET_RXD1/U18[15] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL ENET     /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL enet_rx_data /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL 1U          /*!< Signal channel */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV/U18[18] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL enet_rx_en /*!< Signal name */

/* GPIO_B1_11 (coord C13), ENET_RXER/U18[20] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL enet_rx_er /*!< Signal name */

/* GPIO_B1_07 (coord B12), ENET_TXD0/U18[24] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL ENET     /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL enet_tx_data /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL 0U          /*!< Signal channel */

/* GPIO_B1_08 (coord A12), ENET_TXD1/U18[25] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL ENET     /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL enet_tx_data /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL 1U          /*!< Signal channel */

/* GPIO_B1_09 (coord A13), ENET_TXEN/U18[23] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL enet_tx_en /*!< Signal name */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J2[13]/J3[2]/ENET_INT/U18[21]/INT1_COMBO/U12[11]/DC_I2S2_MCLK/J19[1]/J16[6] */
/* Routed pin properties */
#define BOARD_INITENETPINS_INT1_COMBO_PERIPHERAL GPIO1 /*!< Peripheral name */
#define BOARD_INITENETPINS_INT1_COMBO_SIGNAL gpio_io   /*!< Signal name */
#define BOARD_INITENETPINS_INT1_COMBO_CHANNEL 10U      /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO GPIO1                /*!< GPIO peripheral base pointer */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO_PIN 10U              /*!< GPIO pin number */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO_PIN_MASK (1U << 10U) /*!< GPIO pin mask */
#define BOARD_INITENETPINS_INT1_COMBO_PORT GPIO1                /*!< PORT peripheral base pointer */
#define BOARD_INITENETPINS_INT1_COMBO_PIN 10U                   /*!< PORT pin number */
#define BOARD_INITENETPINS_INT1_COMBO_PIN_MASK (1U << 10U)      /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/* GPIO_SD_B0_05 (coord J2), SD1_D3/J22[2] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D3_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D3_SIGNAL usdhc_data /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D3_CHANNEL 3U        /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), SD1_D2/J22[1] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D2_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D2_SIGNAL usdhc_data /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D2_CHANNEL 2U        /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J22[8]/J17[5] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D1_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D1_SIGNAL usdhc_data /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D1_CHANNEL 1U        /*!< Signal channel */

/* GPIO_SD_B0_02 (coord J1), SD1_D0/J22[7]/J17[4] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D0_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D0_SIGNAL usdhc_data /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D0_CHANNEL 0U        /*!< Signal channel */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J22[3]/J17[6] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CMD_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CMD_SIGNAL usdhc_cmd  /*!< Signal name */

