project-chip/connectedhomeip/examples/platform/nxp/rt/rt1060/board/evkbmimxrt1060/pin_mux.h
/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J22[5]/J17[3] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL USDHC1 /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL usdhc_clk  /*!< Signal name */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_PERIPHERAL USDHC1    /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_SIGNAL usdhc_vselect /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A/U20[D3]/U24[5] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_PERIPHERAL FLEXSPI     /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_SIGNAL FLEXSPI_A_DATA0 /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A/U20[D2]/U24[2] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_PERIPHERAL FLEXSPI     /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_SIGNAL FLEXSPI_A_DATA1 /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A/U20[C4]/U24[3] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_PERIPHERAL FLEXSPI     /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_SIGNAL FLEXSPI_A_DATA2 /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A/U20[D4]/U24[7] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_PERIPHERAL FLEXSPI     /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_SIGNAL FLEXSPI_A_DATA3 /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK/U20[B2]/U24[6] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_PERIPHERAL FLEXSPI    /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_SIGNAL FLEXSPI_A_SCLK /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0/U20[C2]/U24[1] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_PERIPHERAL FLEXSPI     /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_SIGNAL FLEXSPI_A_SS0_B /*!< Signal name */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS/U20[C3] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_PERIPHERAL FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_SIGNAL FLEXSPI_A_DQS /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPIPins(void);

#define BOARD_INITOTWPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK                                                                 \
    0x04000000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/J23[9]/CSI_D7/J46[9]/J33[1] */
/* Routed pin properties */
#define BOARD_INITOTWPINS_CSI_D7_PERIPHERAL GPIO6 /*!< Peripheral name */
#define BOARD_INITOTWPINS_CSI_D7_SIGNAL gpio_io   /*!< Signal name */
#define BOARD_INITOTWPINS_CSI_D7_CHANNEL 26U      /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITOTWPINS_CSI_D7_GPIO GPIO6                /*!< GPIO peripheral base pointer */
#define BOARD_INITOTWPINS_CSI_D7_GPIO_PIN 26U              /*!< GPIO pin number */
#define BOARD_INITOTWPINS_CSI_D7_GPIO_PIN_MASK (1U << 26U) /*!< GPIO pin mask */
#define BOARD_INITOTWPINS_CSI_D7_PORT GPIO6                /*!< PORT peripheral base pointer */
#define BOARD_INITOTWPINS_CSI_D7_PIN 26U                   /*!< PORT pin number */
#define BOARD_INITOTWPINS_CSI_D7_PIN_MASK (1U << 26U)      /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOTWPins(void);

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J46[18]/BT_UART_TXD/U9[4]/I2C3_SCL/J24[3]/J23[13]/J16[2] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_CSI_VSYNC_PERIPHERAL LPUART3 /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_CSI_VSYNC_SIGNAL TX          /*!< Signal name */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J46[12]/WL_DEV_WAKE/U9[10]/J33[4] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_CSI_MCLK_PERIPHERAL LPUART3 /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_CSI_MCLK_SIGNAL RTS_B       /*!< Signal name */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J46[8]/BT_DEV_WAKE/U9[9]/J33[3] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_CSI_PIXCLK_PERIPHERAL LPUART3 /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_CSI_PIXCLK_SIGNAL CTS_B       /*!< Signal name */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J46[16]/BT_UART_RXD/U10[20]/I2C3_SDA/J24[5]/J23[15]/J16[1] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_CSI_HSYNC_PERIPHERAL LPUART3 /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_CSI_HSYNC_SIGNAL RX          /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitArduinoUARTPins(void);

#define BOARD_INITMURATAMODULEPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK                                                        \
    0x01000800U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_11 (coord G10), JTAG_nTRST/J2[3]/INT2_COMBO/U12[9]/LCD_TOUCH_INT/J49[B3]/J16[3] */
/* Routed pin properties */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_PERIPHERAL GPIO1 /*!< Peripheral name */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_SIGNAL gpio_io   /*!< Signal name */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_CHANNEL 11U      /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_GPIO GPIO1                /*!< GPIO peripheral base pointer */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_GPIO_PIN 11U              /*!< GPIO pin number */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_GPIO_PIN_MASK (1U << 11U) /*!< GPIO pin mask */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_PORT GPIO1                /*!< PORT peripheral base pointer */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_PIN 11U                   /*!< PORT pin number */
#define BOARD_INITMURATAMODULEPINS_INT2_COMBO_PIN_MASK (1U << 11U)      /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/J34[5]/U25[15]/WIFI_RST_B/U9[3]/CSI_D9/J46[13]/J16[4] */
/* Routed pin properties */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_PERIPHERAL GPIO1 /*!< Peripheral name */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_SIGNAL gpio_io   /*!< Signal name */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_CHANNEL 24U      /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_GPIO GPIO1                /*!< GPIO peripheral base pointer */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_GPIO_PIN 24U              /*!< GPIO pin number */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_GPIO_PIN_MASK (1U << 24U) /*!< GPIO pin mask */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_PORT GPIO1                /*!< PORT peripheral base pointer */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_PIN 24U                   /*!< PORT pin number */
#define BOARD_INITMURATAMODULEPINS_CSI_D9_PIN_MASK (1U << 24U)      /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMurataModulePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
